---
kind: property
id: P:Autodesk.Revit.DB.Visual.Wave.TextureRealWorldOffsetY
source: html/f77e1bae-a639-e701-d114-fd34bc00bbdc.htm
---
# Autodesk.Revit.DB.Visual.Wave.TextureRealWorldOffsetY Property

The property labeled "Offset Y" from the "Wave" schema.

## Syntax (C#)
```csharp
public static string TextureRealWorldOffsetY { get; }
```

## Remarks
This property is of type "AssetPropertyDistance".